import { createSlice } from "@reduxjs/toolkit";
import { intDataTable } from "../../types/InterfaceInputForm";

const initialState:intDataTable = {
    c_doctype: [
      {
        id: 1,
        value: 'Свидетельство рождения'
      },
      {
        id: 2,
        value: 'Паспорт иностранного гражданина'
      },
      {
        id: 3,
        value: 'Дипломатический паспорт'
      },
      {
        id: 4,
        value: 'Свидетельство о рассмотрение ходатайства о признанинии лица беженцем'
      },
      { id: 5,
        value: 'Вид на жительство в Российской Федерации'
      },
      {
        id: 6,
        value: 'Удостоверение беженца'
      },
    ],
    municipality: [
      { 
        id: 1,
        value: 'Муниципалитет отдел образования МР Абзелиловский район РБ',
        items: 
              [
                {
                  id: 1,
                  value: "МАДОУ детский сад \"Березка\" с.Аскарово"
                },
                {
                  id: 2,
                  value: "МАДОУ \"Теремок\" с.Аскарово"
                },
                {
                  id: 3,
                  value: "МДОБУ \"Сулпылар\" с.Аскарово"
                } 
              ]
      },
      {
        id: 2,
        value: 'МКУ ОО Альшеевский район',
        items: 
              [
                {
                  id: 1,
                  value:"МБДОУ №1 с.Раевский"
                },
                {
                  id: 2,
                  value:"МБДОУ №2 с.Раевский"
                },
                {
                  id: 3,
                  value:"МБДОУ №5 с.Раевский"
                } 
              ]
      },
      {
        id: 3,
        value: 'МКУ Архангельский район',
        items: 
              [
                {
                  id: 1,
                  value: "МБДОУ д/с комибинированного вида \"Теремок\" с.Архангельское"
                },
                {
                  id: 2,
                  value: "МБДОУ ООШ д.Азово"
                },
                {
                  id: 3,
                  value: "филиал МОБУ СОШ д. М.Горький - д/с \"Чебурашка\" д. Заря"
                } 
              ]
      },
    ],
    lgroup: [
      {
        id: 1, value: 'Русский'
      },
      {
        id: 2, value: 'Татарский'
      },
      {
        id: 3, value: 'Башкирский'
      },
    ],
    wdate: [
      {
        id: 1, value: 'Сентябрь 2024'
      },
      {
        id: 2, value: 'Сентябрь 2025'
      },
      {
        id: 3, value: 'Сентябрь 2026'
      },
    ],
    wrem: [
      {
        id: 1, value: 'Да'
      },
      {
        id: 2, value: 'Нет'
      },
    ],
    privilege: [
      {
        id: 1, value: 'Да'
      },
      {
        id: 2, value: 'Нет'
      },
    ],
    desired_kindergarten_id: [
      {
        id: 1, value: ' '
      }
    ],
    c_sex: [
      {
        id: 1, value: 'Мужской'
      },
      {
        id: 2, value: 'Женский'
      },
    ],
    c_citizenship: [
      {
        id: 1, value: 'Гражданин РФ'
      },
      {
        id: 2, value: 'Без гражданства'
      },
      {
        id: 3, value: 'Иностранный гражданин'
      },
    ],
    p1: [
      {
        id: 1, value: 'Нет'
      },
      {
        id: 2, value: 'С нарушением речи'
      },
      {
        id: 3, value: 'С нарушением слуха'
      },
      {
        id: 4, value: 'Часто болеющие'
      },
      {
        id: 5, value: 'С аутизмом'
      },
    ],
    p2: [
      {
        id: 1, value: 'Общеразвивающая'
      },
      {
        id: 2, value: 'Компенсирующая'
      },
      {
        id: 3, value: 'Оздоровительная'
      },
      {
        id: 4, value: 'Комбинированная'
      },
    ],
    p3: [
      {
        id: 1, value: 'Режим кратковременного пребывания(до 5 часов в день'
      },
      {
        id: 2, value: 'Режим сокращенного дня(8-10 часового пребывания)'
      },
      {
        id: 3, value: 'Режим полдного дня(10,5-12 часового пребывания)'
      },
      {
        id: 4, value: 'Группа семейного пребывания'
      },
    ],
    d_doctype: [
      {
        id: 1, value: 'Паспорт иностранного гражданина'
      },
      {
        id: 2, value: 'Дипломатический паспорт'
      },
      {
        id: 3, value: 'Удостоверение беженца'
      },
      {
        id: 4, value: 'Иные документы'
      },
    ],
    law: [
      {
        id: 1, value: 'Нет', checked:'true'
      },
      {
        id: 2, value: `Проживающие в одной семье и имеющие общее 
                      место жительства дети, имеют право преимущественного приема 
                      на обучение по основным общеобразовательным программам дошкольного 
                      образования и начального общего образования в государственные 
                      и муниципальные образовательные организации, 
                      в которых обучаются их братья и (или) сестры`
      },
    ],
    c_ser: [
      {
        id: 1, value: 'I', 
      },  
      {
        id: 2, value: `II`
      },
      {
        id: 3, value: `III`
      },
      {
        id: 4, value: `IV`
      },
      {
        id: 5, value: `V`
      },
      {
        id: 6, value: `VI`
      },
      {
        id: 7, value: `VII`
      },
      {
        id: 8, value: `VIII`
      },
      {
        id: 9, value: `IX`
      },
      {
        id: 10, value: `X`
      },
      {
        id: 11, value: `XI`
      },
      {
        id: 12, value: `XII`
      },
      {
        id: 13, value: `XIII`
      },
      {
        id: 14, value: `XIV`
      },
      {
        id: 15, value: `XV`
      },
      {
        id: 16, value: `XVI`
      },
      {
        id: 17, value: `XVII`
      },
      {
        id: 18, value: `XVIII`
      },
      {
        id: 19, value: `IX`
      },
      {
        id: 20, value: `X`
      },
    ],
  }

  export const inputSlicer = createSlice({
    name: 'inputData',
    initialState,
    reducers: {

    }
  })

  export default inputSlicer.reducer